//--------------------------------------------------------
// バトルの進行関係
//--------------------------------------------------------
#define BATTLE_INIT			0
#define BATTLE_START		100
#define BATTLE_STANDBY		200
#define BATTLE_END			500

//--------------------------------------------------------
//	外部変数定義
//--------------------------------------------------------
extern SINT32 system_sec, mis_num;

//--------------------------------------------------------
//	構造体関係
//--------------------------------------------------------
typedef struct
{
	FLOAT x, y, width, height;
}RECT_4_FLOAT;


extern void BATTLE_main_routine(void);
