//-----------------------------------------------------------------------------
//							サウンド関係
//														programed by N-KAITO
//-----------------------------------------------------------------------------

#include    "../flame_include.h"
#include "audio/include/AudioEngine.h"

//----------------------------------------------------------------
//  音の再生
//  file_name   再生するファイルのデータ
//  loop        ループ再生するかどうか
//  vol         音のボリューム
//  帰り値      オーディオNO
//  オーディオのキャッシュは出来るけどAndroidの方はキャッシュできないからしない方が良い
//----------------------------------------------------------------
SINT32 SOUND_start(SINT8* file_name, bool loop, FLOAT vol)
{
    auto audio = AudioEngine::play2d(file_name, loop, vol, nullptr);
    return audio;
}

//----------------------------------------------------------------
//　今流れているBGMやSEをすべて止めてメモリ内のSEを全てクリアする
//----------------------------------------------------------------
void SOUND_init(void)
{
    AudioEngine::pauseAll();
    AudioEngine::uncacheAll();
}

//----------------------------------------------------------------
//  指定したオーディオNOの曲を止める
//----------------------------------------------------------------
void SOUND_stop(SINT32 audio_no)
{
    AudioEngine::stop(audio_no);
}